In [3]:
import pandas as pd

In [7]:
data = pd.read_csv('E:/DataSets/input.csv')

In [9]:
data.head()

   id   name  salary  start_date        dept
0   1   Rick  623.30    1/1/2012          IT
1   2    Dan  515.20   9/23/2013  Operations
2   3  Tusar  611.00  11/15/2014          IT
3   4   Ryan  729.00   5/11/2014          HR
4   5   Gary  843.25   3/27/2015     Finance

In [13]:
data.head(7)

   id    name  salary  start_date        dept
0   1    Rick  623.30    1/1/2012          IT
1   2     Dan  515.20   9/23/2013  Operations
2   3   Tusar  611.00  11/15/2014          IT
3   4    Ryan  729.00   5/11/2014          HR
4   5    Gary  843.25   3/27/2015     Finance
5   6   Rasmi  578.00   5/21/2013          IT
6   7  Pranab  632.80   7/30/2013  Operations

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      int64
 1   name        8 non-null      object
 2   salary      8 non-null      float64
 3   start_date  8 non-null      object
 4   dept        8 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 452.0+ bytes

In [17]:
data.select_dtypes(include='object').nunique()

name          8
start_date    8
dept          4
dtype: int64

In [19]:
data.select_dtypes(include='float64').nunique()

salary    8
dtype: int64

In [26]:
data.select_dtypes(include='int64').nunique()

NameError: name 'data' is not defined